<?php
session_start(); // подключаем механизм сессий
////////////////////////////////////////////////////////////////////
// обрабатываем выход
////////////////////////////////////////////////////////////////////
if (isset($_GET['logout'])) // если был переход по ссылке Выход
{
    unset($_SESSION['user']); // удаляем информацию о пользователе
    setcookie('login', '', time());
    setcookie('password', '', time());
    header('Location: /'); // переадресация на главную страницу
    exit(); // дальнейшая работа скрипта излишняя
}
////////////////////////////////////////////////////////////////////
// если аутентификации нет, но переданы данные для ее проведения
////////////////////////////////////////////////////////////////////
if (!isset($_SESSION['user']) && isset($_POST['login']) &&
    isset($_POST['password']) && $f = fopen('users.csv', 'rt')) {
    setcookie('login', $_POST['login'], time() + 60 * 60 * 24 * 30);
    setcookie('password', $_POST['password'], time() + 60 * 60 * 24 * 30);
    while (!feof($f)) // пока не найден конец файла
    {
// разбиваем текущую строку файла в массив
        $test_user = explode(',', fgets($f));
        if (trim($test_user[0]) == $_POST['login']) // если найден логин
        {
            if (isset($test_user[1]) && // если пароли совпали
                trim($test_user[1]) == $_POST['password']) // сохраняем
            {
                $_SESSION['user'] = $test_user; // в сессию
                header('Location: /'); // редирект на главную
                exit(); // дальнейшая работа скрипта излишняя
            } else // если пароль не совпал
                break; // прекращаем итерации
        }
    }
    echo '</div>Неверный логин или пароль!</div>';
    fclose($f); // закрываем файл
}
////////////////////////////////////////////////////////////////////
// если аутентификации все еще нет
////////////////////////////////////////////////////////////////////
if (!isset($_SESSION['user'])) {
// выводим форму для аутентификации
    echo '<form name="auth" method="post" action="">
 <input type="text" name="login"';
//если логин уже вводился ранее и был передан в программу
    if (isset($_POST['login'])) {
        echo ' value="' . $_POST['login'] . '"'; // заполняем значение поля
    } elseif (isset($_COOKIE['login'])) {
        echo ' value="' . $_COOKIE['login'] . '"';
    }
    echo '></br><input type="password" name="password"';
    if (!isset($_POST['login']) && isset($_COOKIE['password'])) {
        echo ' value="' . $_COOKIE['password'] . '"';
    }
    echo '></br>
 <input type="submit" value="Войти">
 </form>';
} else
////////////////////////////////////////////////////////////////////
// если аутентификация успешно произведена
////////////////////////////////////////////////////////////////////
{
    echo '<a href="/?logout=">Выход</a>'; // выводится ссылка для выхода
// выводится информация для аутентифицированного пользователя
    echo '<p>Добро пожаловать, ' . $_SESSION['user'][0] . '!</p>';
    include 'tree.php'; // выводим содержимое дерева файлов
}
?>

